"""Розробити клас Human.
Людина має:
    Ім'я
    Прізвище
    Дату народження
    Стать
    Енергію = 100
Люди можуть:
    Їсти (Енергія +5)
    Спати (Енергія +10)
    Говорити (Енергія -5)
    Ходити (Енергія -10)
    Робити домашку (Енергія -90)
if __name__ == "__main__":
    Створити 3 чоловіків та 2 жінок, Задати кожному з них виконання
    декількох дій, вивести в кого найбільше енергії лишилося.
Створити тести на клас та на атрибути класу.
"""

class Human:
    def __init__(self, ім_я, прізвище, дата_народження, стать):
        self.ім_я = ім_я
        self.прізвище = прізвище
        self.дата_народження = дата_народження
        self.стать = стать
        self.енергія = 100

    def їсти(self):
        self.енергія += 5

    def спати(self):
        self.енергія += 10

    def балакати(self):
        self.енергія -= 5

    def ходити(self):
        self.енергія -= 10

    def робити_дз(self):
        self.енергія -= 90


if __name__ == "__main__":
    люди = [
        Human("Іван", "Петров", "01.01.1990", "чоловік"),
        Human("Марія", "Іванова", "15.05.1985", "жінка"),
        Human("Олександр", "Сидоров", "20.11.1982", "чоловік"),
        Human("Анна", "Ковальчук", "10.09.1995", "жінка"),
        Human("Петро", "Коваль", "03.07.2000", "чоловік")
    ]

    люди[0].балакати()
    люди[1].спати()
    люди[2].їсти()
    люди[3].робити_дз()
    люди[4].ходити()
    
    найбільша_енергія = max(люди, key=lambda людина: людина.енергія)
    
    print(f"Найбільше енергії залишилося у {найбільша_енергія.ім_я} {найбільша_енергія.прізвище}")
