# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""
alien_color = "green"
if alien_color  == "green":
    print("Task 1, Вітаємо, ви щойно заробили 5 балів")

# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""
alien_color = "red"
if alien_color  == "green":
    print("Task 2, Вітаємо, ви щойно заробили 5 балів")
else:
    print("Task 2, Вітаємо, ви щойно заробили 10 балів")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
alien_color = ["red", "green", "yellow"]
for color in alien_color:
    if color == "red":
        print("red", "Вітаємо, ви щойно заробили 15 балів") 
    elif color != "green":
        print("not green", "Вітаємо, ви щойно заробили 10 балів")
    elif color == "green":
        print("green", "Вітаємо, ви щойно заробили 5 балів")

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
pizza_topping = []
while True:
    piz_topping = input("Введіть інгредієнт")
    if piz_topping == "quit":
        break 
    pizza_topping.append(piz_topping)
for piz_topping in pizza_topping:
    print("-" + piz_topping)
# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр цілого числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть число: 12345
Сума цифр числа 12345: 15
"""
u_input = input("Ведіть число:")
sum_of_number = 0
for number in u_input:
    sum_of_number += int(number)
print("Task 6", sum_of_number)


# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""
calc_result = 0
while True:
    input_i = input("введіть число:")
    calc_result += int(input_i)
    if input_i == "0":
        break
print("Task 8, сума", calc_result)



# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""
import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")

for guesses in range(max_guesses):
    g = int(input(" Вгадайте число:"))
    if g < secret_number:
        print("Занадто мале число, наступна спроба")
    elif g > secret_number:
        print("Занадто велике число, наступна спроба")
    else:
        print(f"Ви вгадали число {secret_number}")
        break
else:
    print(f"Нажаль ви не вгадали, це було {secret_number}")

# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]
for i in fruits:
    if i == "orange":
        continue
    else: print("task 9", i)

# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""

numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [i**2 for i in numbers if i%2==0]
print("Task 10, список квадратів парних чисел", result)  #  [4, 16, 36, 64, 100]
