# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""

alien_color = "green"

if alien_color == "green":
    print("Ви заробили 5 балів")

# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""

alien_color = "yello"

if alien_color == "green":
    print("Ви заробили 5 балів")
else:
    print("Ви заробили 10 балів")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
alien_color = ['green', 'yellow', 'red']

for c in alien_color:
    if c == "green":
        print("Ви заробили 5 балів")
    elif c == "red":
        print("Ви заробили 10 балів")
    else:
        print("Ви заробили 15 балів")

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""

pizza_toppings = []
pizza_topping = ""

while pizza_topping.lower() != 'quit':
    pizza_topping = input("Введіть начинку для піци (або 'quit' для завершення): ")
    if pizza_topping.lower() != 'quit':
        print(f"Додаємо {pizza_topping} до вашої піци.")
        pizza_toppings.append(pizza_topping)

print("Ваш список начинок для піци:")
for topping in pizza_toppings:
    print(topping)

# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр натурального числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть натуральне число: 12345
Сума цифр числа 12345: 15
"""

while True:
    num = input("Введіть натуральне число: ")

    if not num.isdigit()or int(num) <= 0:
        print("Будь ласка, введіть правильне натуральне число.")
    else:
        num = int(num)
        sum_of_digits = 0
        while num > 0:
            sum_of_digits += num % 10
            num //= 10

        print(f"Сума цифр числа: {sum_of_digits}")
        break

# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""

total_sum = 0

while True:
    user_input = input("Введіть число (для завершення введіть 0): ")

    if user_input.isdigit():
        num = int(user_input)
    else:
        print("Некоректний ввід. Будь ласка, введіть число.")
        continue

    if user_input =='0':
        break

    total_sum += num

print(f"Результат сумування: {total_sum}")

# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""
import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")

for guesses in range(1, max_guesses + 1):
    user_guess = int(input(f"Спроба {guesses}: Введіть своє припущення: "))

    if user_guess < secret_number:
        print("Занадто мало. Спробуйте ще раз.")
    elif user_guess > secret_number:
        print("Занадто велико. Спробуйте ще раз.")
    else:
        print(f"Вітаємо! Ви вгадали число {secret_number} за {guesses} спроби.")
        break
else:
    print(f"На жаль, ви не вгадали. Загадане число було {secret_number}.")

# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]

for fruit in fruits:
    if fruit == "orange":
        continue
    print(fruit)

# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [x**2 for x in numbers if x % 2 == 0]
print(result)  #  [4, 16, 36, 64, 100]
