# task 1
"""  Уявіть, що інопланетянина з кольором alien_color щойно збили в грі.
Створіть змінну під назвою alien_color і призначте їй значення 'green', 'yellow', або 'red'.
Напишіть оператор if, щоб перевірити, чи колір прибульця 'green'.
Якщо так, надрукуйте повідомлення про те, що гравець щойно заробив 5 балів.
"""
colours = ['green', 'yellow', 'red']
alien_colour = random.choice(colours)
if alien_colour == "green":
    print(f"Ваш інопланетянин {alien_colour} кольору і ви виграли 5 балів")

# task 2
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою else.
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Зробіть так, щоб виводилася умова else.
"""
print(f"Ви виграли 5 балів" if alien_colour == "green" else "Ви виграли 10 балів")

# task 3
# task 4
"""  Скопіюйте пеопередню відповідь, змініть і доповніть її умовою elif.
змінну під назвою alien_color перетворіть у список значень: 'green', 'yellow', 'red'
Якщо колір прибульця зелений, надрукуйте, що гравець щойно заробив 5 балів.
Якщо колір прибульця не зелений, надрукуйте, що гравець щойно заробив 10 балів.
Якщо прибулець червоний, надрукуйте повідомлення про те, що гравець заробив 15 очок
+ напишіть цикл for що перебере і обробить всі значення списку alien_color
"""
alien_colour = ["green", "yellow", "red"]
for colour in alien_colour:
    if colour == "green":
        print("Ви виграли 5 балів")
    elif colour == "yellow":
        print("Ви виграли 10 балів")
    else:
        print("Ви виграли 15 балів")

# task 5
"""  Начинки для піци (pizza_topping): напишіть цикл, який пропонує користувачеві ввести ряд начинок
для піци, доки він не введе значення 'quit'. Коли вони введуть кожну начинку,
надрукуйте повідомлення про те, що ви додасте цю начинку до їхньої піци.
"""
pizza_toppings = []
while True:
    topping = input("Введіть начинку для піци (або 'quit' для завершення): ")
    if topping.lower() == 'quit':
        break
    else:
        pizza_toppings.append(topping)
        print(f"Додаємо {topping} до вашої піци.")

# task 6
"""  Напишіть програму, яка знаходить суму всіх цифр цілого числа, яке вводить користувач.
Для перебору вводу від користувача використовуйте цикл. Виведіть суму цифр числа на екран.
Приклад виконання програми:
Введіть число: 12345
Сума цифр числа 12345: 15
"""
user_input = None
while True:
    user_input = input("Введіть натуральне число: ")
    if user_input.isdigit():
        break
    else:
        print('insert numbers')
sum_of_digits = 0
for digit in user_input:
    sum_of_digits += int(digit)
print(f"Сума цифр числа {user_input}: {sum_of_digits}")

# task 7
"""  Потрібно написати програму, яка просить користувача ввести числа, доки він не введе 0.
Програма повинна підрахувати суму всіх введених чисел, окрім 0, і вивести її на екран.
Це повинно працювать як калькулятор, в який ввів цифру - нажав плюс - ввів наступну цифру.
Після введеня 0 показує результат сумування.
Розв'язати з використанням циклу while та break
"""
sum_of_numbers = 0
while True:
    user_input = input("Введіть число (або 0 для завершення): ")
    if user_input.isdigit():
        number = int(user_input)
        if number == 0:
            break
        sum_of_numbers += number
    else:
        print("Будь ласка, введіть дійсне число.")
print(f"Сума введених чисел (без 0): {sum_of_numbers}")

# task 8
"""  З використанням циклу for реалізуйте гру "Вгадай число".
Початок програми написаний, гравець має 5 спроб відгадати випадкове число від 1 до 20,
яке було згенеровано за допомогою функції randint() модуля random.
У кожній спробі гравець вводить своє припущення, після чого програма повідомляє, чи
було припущення занадто великим або занадто малим, чи гравець вгадав число.
"""
import random
secret_number = random.randint(1, 20)
guesses = 0
max_guesses = 5
print("Вгадайте число від 1 до 20 за 5 спроб!")
for guesses in range(0, max_guesses):
    guess = int(input(f"Спроба {guesses}: Введіть число: "))
    if guess == secret_number:
        print(f"Вітаємо! Ви вгадали число {secret_number} за {guesses} спроб!")
        break
    elif guess < secret_number:
        print("Загадане число більше.")
    else:
        print("Загадане число менше.")

# task 9
"""  Задача з використанням циклу for та continue. Задано список фруктів 'fruits'
потрібно вивести на екран всі елементи списку, окрім "orange".
"""
fruits = ["apple", "banana", "orange", "grape", "mango"]
for fruit in fruits:
    if fruit == "orange":
        continue
    print(fruit)

# task 10
"""  Задано список чисел numbers, потрібно знайти список квадратів
парних чисел зі списку. Спробуйте використати if та цикл for в один рядок.
"""
numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = [x ** 2 for x in numbers if x % 2 == 0]
print(result)  #  [4, 16, 36, 64, 100]
